Autodesk.Revit.DB.NumberingSequenceInfo.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.NumberingSequenceInfo.HasGaps
True if the sequence has gaps
Since:
2027

Autodesk.Revit.DB.NumberingSequenceInfo.Count
Number of elements in the sequence
Since:
2027

Autodesk.Revit.DB.NumberingSequenceInfo.LastNumber
Last number in the sequence
Since:
2027

Autodesk.Revit.DB.NumberingSequenceInfo.FirstNumber
First number in the sequence
Since:
2027

Autodesk.Revit.DB.NumberingSequenceInfo.FormattedLastNumber
First number in the sequence formatted
Since:
2027

Autodesk.Revit.DB.NumberingSequenceInfo.FormattedFirstNumber
First number in the sequence formatted
Since:
2027

Autodesk.Revit.DB.NumberingSequenceInfo.PartitionName
identifier for the partition
Since:
2027

Autodesk.Revit.DB.NumberingSequenceInfo.#ctor(System.String,System.String,System.String,System.Int32,System.Int32,System.Int32,System.Boolean)
Create an NumberingSequenceInfo object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.NumberingSequenceInfo.#ctor
Create an empty AdvancedNumberingSchemaSettings object.
Since:
2027

Autodesk.Revit.DB.NumberingSequenceInfo
A class containing the information regarding a numbering sequence to be used in the UI
Since:
2027